<?php
$lang['friendlyname'] = 'Άρθρωμα Αρχειοθέτησης';
$lang['postinstall'] = 'Μήνυμα μετά την εγκατάσταση, π.χ., Βεβαιωθείτε ότι έχει οριστεί "Χρήση αρχειοθέτησης" στα δικαιώματα πρόσβασης αυτού του αρθρώματος!';
$lang['postuninstall'] = 'Το άρθρωμα καταργήθηκε';
$lang['uninstalled'] = 'Το άρθρωμα απεγκαταστάθηκε.';
$lang['installed'] = 'Εγκαταστάθηκε η έκδοση %s του αρθρώματος.';
$lang['prefsupdated'] = 'Οι προτιμήσεις για το άρθρωμα ενημερώθηκαν.';
$lang['accessdenied'] = 'Απαγορεύεται η πρόσβαση. Ελέγξτε τα δικαιώματα πρόσβασης.';
$lang['error'] = 'Σφάλμα!';
$lang['upgraded'] = 'Το άρθρωμα αναβαθμίστικε στην έκδοση %s.';
$lang['title_mod_prefs'] = 'Προτιμήσεις αρθρώματος';
$lang['content'] = 'Αντικείμενο περιεχομένου';
$lang['htmlblob'] = 'Νησίδα HTML';
$lang['stylesheet'] = 'Πρότυπο εμφάνισης (Stylesheet)';
$lang['template'] = 'Πρότυπο';
$lang['prev'] = '&lt; Επόμενη σελίδα';
$lang['next'] = 'Επόμενη σελίδα &gt;';
$lang['column_type'] = 'Τύπος';
$lang['column_name'] = 'Όνομα';
$lang['column_revision'] = 'Αναθεώρηση';
$lang['column_date'] = 'Ημερομηνία';
$lang['column_action'] = 'Λειτουργία';
$lang['title_admin_panel'] = 'Αρχειοθέτης';
$lang['title_admin_prefs'] = 'Προτιμήσεις αρχειοθέτησης';
$lang['title_admin_snaps'] = 'Διαχείριση αντιγράφων βάσης δεδομένων';
$lang['listitems'] = 'Ανεπτυγμένη προβολή αρχειοθέτησης';
$lang['simplelist'] = 'Απλή προβολή αρχειοθέτησης';
$lang['listsnapshots'] = 'Αντίγραφα βάσης δεδομένων';
$lang['adminprefs'] = 'Προτιμήσεις αρχειοθέτησης';
$lang['welcome_text'] = 'Επιλέξτε μια λειτουργία στην αρχειοθέτηση';
$lang['restore'] = 'Επαναφορά στην τρέχουσα κατάσταση';
$lang['preview'] = 'Προεπισκόπηση';
$lang['title_preview'] = 'Προεπισκόπηση της αναθεώρησης %s';
$lang['title_save_snapshot'] = 'Αποθήκευση ενός αντιγράφου ασφαλείας του ιστοτόπου';
$lang['title_snapshot_name'] = 'Όνομα αντιγράφου ασφαλείας';
$lang['title_snapshot_not_yet'] = 'Η δημιουργία αντιγράφων ασφαλείας δεν έχει τεθεί ακόμη σε λειτουργία.';
$lang['title_filter_type'] = 'Εμφάνιση';
$lang['title_filter_none'] = 'Όλοι οι τύποι αρχειοθέτησης';
$lang['title_filter_content'] = 'Μόνον περιεχόμενο';
$lang['title_filter_htmlblob'] = 'Μόνον νησίδες HTML';
$lang['title_filter_stylesheet'] = 'Μόνον Stylesheets';
$lang['title_filter_template'] = 'Μόνον Templates';
$lang['sort_desc'] = 'Φθίνουσα Ταξινόμηση';
$lang['sort_asc'] = 'Αύξουσα Ταξινόμηση';
$lang['surerestore'] = 'Είστε σίγοθροι ότι θέλετε να επαναφέρετε την αναθεώρηση %s?';
$lang['title_purge_count'] = 'Πόσες αναθεωρήσεις γαι την κάθε σελίδα να φυλάσσονται?';
$lang['title_purge_unlimited'] = 'Να φυλάσσονται απεριόριστες αναθεωρήσεις για την κάθε σελίδα';
$lang['title_purge_5_revisions'] = 'Να φυλάσσονται οι πέντε πιο πρόσφατες αναθεωρήσεις για την κάθε σελίδα';
$lang['title_purge_10_revisions'] = 'Να φυλάσσονται οι δέκα πιο πρόσφατες αναθεωρήσεις για την κάθε σελίδα';
$lang['title_purge_20_revisions'] = 'Να φυλάσσονται οι είκοσι πιο πρόσφατες αναθεωρήσεις για την κάθε σελίδα';
$lang['title_purge_50_revisions'] = 'Να φυλάσσονται οι πενήντα πιο πρόσφατες αναθεωρήσεις για την κάθε σελίδα';
$lang['title_purge_time'] = 'Για πιο χρονικό διάστημα θα πρέπει να φυλάσσονται οι αναθεωρήσεις?';
$lang['title_purge_forever'] = 'Οι αναθεωρήσεις να φυλάσσονται για πάντα';
$lang['title_purge_1_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις της τελευταίας ημέρας';
$lang['title_purge_7_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων 7 ημερών';
$lang['title_purge_14_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων 14 ημερών';
$lang['title_purge_30_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων 30 ημερών';
$lang['title_purge_90_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων 90 ημερών';
$lang['title_purge_180_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων 180 ημερών';
$lang['title_purge_365_days'] = 'Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων 365 ημερών';
$lang['title_date_format'] = 'Μορφή Ημερομηνίας';
$lang['date_format_help'] = 'Οι μορφές ημερομηνίας κατασκευάστηκαν με την χρήση κώδικα standard PHP "date" format. Για περισσότερες πληροφορίες μεταβείτε στην διεύθυνση <a href="http://us4.php.net/manual/en/function.date.php">http://us4.php.net/manual/en/function.date.php</a>. Μην ξεχνάτε να αποφεύγετε όποιον χαρακτήρα δεν θέλετε μεταφραστεί με την μορφή ημερομηνίας!<br />';
$lang['error_invalid_info'] = 'Προέκυψε σφάλμα κατα την διαδικασία ανάκτησης αγνώστου τύπου αντικειμένου';
$lang['restored_template'] = 'Ανακτήθηκε το πρότυπο %s στην αναθεώρηση %s';
$lang['restored_content'] = 'Ανακτήθηκε η σελίδα %s στην αναθεώρηση %s';
$lang['restored_stylesheet'] = 'Ανακτήθηκε το stylesheet %s στην αναθεώρηση %s';
$lang['restored_htmlblob'] = 'Ανακτήθηκε η νησίδα HTML Blob %s στην αναθεώρηση %s';
$lang['title_purge_warning'] = 'Προειδοποίηση! Αν έχετε επιλέξει και αρίθμηση αναθεωρήσεων και χρονική σειρά, Η μικρότερη απο τις δύο τιμές θα επικρατήσει όταν το σύστημα θα πρέπει να φυλάξει ή να μην φυλάξει μια αναθεώρηση.';
$lang['title_purge_warning2'] = 'Προειδοποίηση! Η επιλογή σας θα ενεργοποιηθεί την επόμενη φορά  που θα επεξεργαστείτε μία σελίδα. Έχει εφαρμογή στην αρχειοθέτηση όταν η σχετική σελίδα έχει επεξεργαστεί (έτσι εαν είχατε επιλέξει εκ των προτέρων "Οι αναθεωρήσεις να φυλάσσονται για πάντα" και στην συνέχεια αλλάξατε σε "Να φυλάσσονται οι πέντε πιο πρόσφατες αναθεωρήσεις για την κάθε σελίδα", Η βάση δεδομένων θα διατηρεί όλα τα αντίγραφα ιστορικά για κάθε σελίδα μέχρι να επεξεργαστείτε μία σελίδα; μετά την επεξεργασία η βάση δεδομένων θα διατηρεί μονον τις 5 προηγούμενες αναθεωρήσεις.';
$lang['moddescription'] = 'Αρχειοθέτηση και επαναφορά Περιεχομένου, Style Sheets, νησίδων HTML, και προτύπων.';
$lang['changelog'] = '<ul><li>Έκδοση 0.1 - 29 Δεκεμβρίου 2005. Αρχική διανομή.</li>';
$lang['help'] = '<h3>Τι κάνει αυτό το άρθρωμα?</h3>
<p>Αυτό το άρθρωμα, μετά την εγκατάσταση του, διατηρεί ένα αντίγραφο οποιασδήποτε σελίδας περιεχομένου, νησίδας HTML, ή προτύπου στο στάδιο της επεξεργασίας του (Τα stylesheets σύντομα θα προστεθούν στην λίστα). Παρέχει επίσης ενα περιβάλλον ώστε ο διαχειριστής να μπορεί να επαναφέρει οτιδήποτε απο το αρχείο στην τρέχουσα φάση.</p>
<p>Ουσιαστικά αυτό σημαίνει ότι μπορεί κανείς να επεξεργαστεί διάφορα στοιχεία του ιστοτόπου και να ακυρώσει αυτές τις αλλαγές επαναφέροντας τα στοιχεία σε προηγούμενη ημερομηνία.</p>
<p>Μπορείτε να συντηρείτε αυτόματα το αρχείο είτε αναφορικά με τον μετρητή αναθεωρήσεων (π.χ., Να φυλάσσεται μόνο ενα συγκεκριμένος αριθμός αναθεωρήσεων από κάθε σελίδα, νησίδα HTML, και Πρότυπο) ή με βάση την ημερομηνία (π.χ., Να φυλάσσονται μόνον οι αναθεωρήσεις των τελευταίων ν ημερών). Μπορείτε βέβαια να μην συντηρείτε την αρχειοθέτηση αφήνοντας την συσσώρευση μέχρι την υπερπλήρωση της βάσης δεδομένων.</p>
<h3>Τί είναι αυτό που δεν παρέχεται?</h3>
<p>Αυτό το σύστημα ελέγχου αναθεωρήσεων δεν είναι πραγματικό. Εξ αιτίας της δομής των δεδομένων του CMS Made Simple, ήταν υπερβολική η εφαρμογή ενός πραγματικου συστήματος RCS proved για μένα τον συγγραφέα. Στο μέλλον θα είναι εφικτό.</P>
<ul>
<li>Τα Stylesheets δεν υποστηρίζονται ακόμη εξαιτίας κάποιων αλλαγών που πρέπει να γίνουν στον κύριο κώδικα.</li>
<li>Δεν αρχειοθετούνται όλα τα metadata. Οι ιδιότητες των σελίδων περιεχομένου όπως η ιεραρχική θέση, ιδιοκτησία,ενεργό-μή ενεργό, ορατό-μή ορατό κλπ δεν αρχειοθετούνται. Παρομοίως οι συσχετίσεις των stylesheet και των προτύπων δεν αρχειοθετούνται.</li>
<li>Η διαδικασία τήρησης αντιγράφων ασφαλείας (π.χ., αντίγραφο της ακριβώς κατάστασης του συνολικού ιστοτόπου σε δεδομένη στιγμή) δεν λειτουργεί. Ισως αργότερα.</li>
<li>Το σύστημα δεν αποθηκεύει deltas, αλλά συνολικά αντίγραφα του κάθε αρχείου. Μπορεί έτσι να καταναλώνεται περισσότερος χώρος αλλά είναι πιο εύκολη η λειτουργία του.</li>
</ul>
<h3>Οδηγίες χρήσης</h3>
<h4>Γενικά</h4>
<p>Μετά την εγκατάσταση το σύστημα ξεκινά αυτόματα την αποθήκευση των αλλαγών στα αρχεία. Δεν χρειάζεται καμμία ιδιαίτερη επέμβαση.</p>
<h4>Λήξη αρχειοθέτησης</h4>
<p>Οποιοσδήποτε διαχειριστής που έχει το δικαίωμα πρόσβασης "Διαχείριση Αρχειοθέτησης" μπορεί να πάει στην περιοχή διαχείρισης αρχειοθέτησης, και να ορίσει τις παραμέτρους λήξης αρχειοθέτησης στις "Προτιμήσεις αρχειοθέτησης". Έχετε κατα νού πόσο <strong>βραχυχρόνιες</strong> είναι οι ρυθμίσεις που θα ορίσετε για την λήξη -- αν ορίσετε "Να φυλάσσονται για πάντα" με βάση την χρονική λήξη, αλλά μόνον  "Να φυλάσσονται οι 5 τελευταίες αναθεωρήσεις" από την λήξη θα αποθηκευτούν τις τελευταίες 5.</p>
<h4>Ανάκτηση απο το αρχείο</h4>
<p>Οποιοσδήποτε διαχειριστής που έχει το δικαίωμα πρόσβασης "Διαχείριση Αρχειοθέτησης" μπορεί να δεί το ιστορικό των αναθεωρήσεων. Υπάρχουν 2 τρόποι: ο απλός και ο για προχωρημένους. Ο απλός εμφανίζει μια λίστα όλων των αντικειμένων στο αρχείο τα οποία μπορείτε να ταξινομείτε με βάση το όνομα ή τον τύπο. Ο για προχωρημένους προβάλλει όλες τις αναθεωρήσεις όλων των αντικειμένων στο αρχείο; τα οποία μπορείτε να ταξινομείτε με βάση το όνομα, τον τύπο ή τον αριθμό αναθεώρησης.</p>
<p>Βασικά θα βρείτε το αντικείμενο μέσς του απλού τρόπου. Με την χρήση του pulldown μενού, μπορείτε να εφαρμόσετε φίλτρο για την εμφάνιση ενός μόνο τύπου αντικειμένου στο αρχείο (Περιεχόμενο, πρότυπο, νησίδα HTML, ή Stylesheet). Κάντε κλίκ στο όνομα του αντικειμένου για να μεταβείτε στην σελίδα ιστορικού για αυτό. Μπορείτε να δείτε την προεπισκόπηση του αντικειμένου (στην περίπτωση σελίδας περιεχομένου) με κλίκ στο εικονίδιο "Προεπισκόπηση".</p>
<P>Η επαναφορά ενός στοιχείου γίνεται με κλίκ στο εικονίδιο "Επαναφορά" στα δεξιά. Αυτό ήταν!</p>
<h3>Μελλοντικές βελτιώσεις (παρατίθεται το αγγλικό κείμενο αυτούσιο)</h3>
<ul>
<li>Implementing Stylesheet archives.</li>
<li>Preview of Templates?</li>
<li>Preview of HTML Blobs?</li>
<li>Snapshots (e.g., an archive of the exact state of the entire website at some instant in time) .</li>
<li>Better/more efficient storage? Store deltas?</li>
</ul>
<h3>Features That Might Be Misinterpreted as Bugs</h3>
<ul>
<li>Restoring Content creates an additional revision. So if you have versions 1 - 4, and you restore to version 1, you\'ll get an additional copy of revision 1 called "revision 5" thrown in to your archive.</li>
<li>If you have changed the name of a Page, it will show up under both names in the Simple Archive View. Clicking on either name will show you all revisions of that page, without regard to the name.</li>
</ul>
<h3>Support</h3>
<p>This module does not include commercial support. However, there are a number of resources available to help you with it:</p>
<ul>
<li>For the latest version of this module, FAQs, or to file a Bug Report or buy commercial support, please visit SjG\'s
module homepage at <a href="http://www.cmsmodules.com">CMSModules.com</a>.</li>
<li>Additional discussion of this module may also be found in the <a href="http://forum.cmsmadesimple.org">CMS Made Simple Forums</a>.</li>
<li>The author, SjG, can often be found in the <a href="irc://irc.freenode.net/#cms">CMS IRC Channel</a>.</li>
<li>Lastly, you may have some success emailing the author directly.</li>  
</ul>
<p>As per the GPL, this software is provided as-is. Please read the text
of the license for the full disclaimer.</p>

<h3>Copyright and License</h3>
<p>Copyright &copy; 2005, Samuel Goldstein <a href="mailto:sjg@cmsmodules.com">&lt;sjg@cmsmodules.com&gt;</a>. All Rights Are Reserved.</p>
<p>This module has been released under the <a href="http://www.gnu.org/licenses/licenses.html#GPL">GNU Public License</a>. You must agree to this license before using the module.</p>
';
?>